
GetPassphraseDescription = "Du behöver ett lösenord för att låsa upp den privata nyckeln för användare: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "Du behöver ett lösenord för att låsa upp den privata nyckeln för användare: \"%@\", ID %@, (ID för huvudnyckel %@)";
PassphraseLabel = "Lösenord:";




/* For Key-Status */
"Invalid" = "Ogiltig";
"Revoked" = "Återkallad";
"Expired" = "Utgången";
"Disabled" = "Avaktiverad";
"Unknown" = "Okänd";
"Never" = "Aldrig";
"Marginal" = "Marginell";
"Full" = "Komplett";
"Ultimate" = "Fullständig";


/* For Undo and Redo */
Undo_NewKey = "Ny nyckel";
Undo_Delete = "Radera";
Undo_CleanKey = "Rensa";
Undo_MinimizeKey = "Minimera";
Undo_RevokeKey = "Återkalla nyckel";
Undo_ChangeExpirationDate = "Ändra utgångsdatum";
Undo_ChangePassphrase = "Ändra lösenord";
Undo_AlgorithmPreferences = "Ändra algoritminställningar";
Undo_Import = "Importera";
Undo_AddSignature = "Lägg till signatur";
Undo_RemoveSignature = "Ta bort signatur";
Undo_RevokeSignature = "Återkalla signatur";
Undo_AddSubkey = "Lägg till undernyckel";
Undo_RemoveSubkey = "Ta bort undernyckel";
Undo_RevokeSubkey = "Återkalla undernyckel";
Undo_AddUserID = "Lägg till användar-ID";
Undo_RemoveUserID = "Ta bort användar-ID";
Undo_RevokeUserID = "Återkalla användar-ID";
Undo_PrimaryUserID = "Primärt användar-ID";
Undo_AddPhoto = "Lägg till bild";
Undo_RefreshFromServer = "Ladda om från server";
Undo_ReceiveFromServer = "Ta emot från server";



/* Algorithm names */
CIPHER_ALGO_NONE = "Ingen";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Ingen";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Algoritm_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Signerad";
"Signature expired" = "Signaturen har gått ut";
"Key expired" = "Nyckeln har gått ut";
"Bad signature" = "Signatur och innehåll matchar inte. Detta kan betyda att innehållet har mixtrats med.";
"Signature revoked" = "Signaturen har återkallats";
"Signature error" = "Signaturfel";
"Unverifiable signature" = "Signaturen kan inte verifieras.";
"Signed by stranger" = "Signaturen kan inte verifieras eftersom den motsvarande publika nyckeln saknas.";


/* Key Descriptions */
KeyDescriptionAndMore = "och %lu mer";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Varning: Din nyckel håller på att gå ut";
KeyExpiryWarning_Msg = "Din nyckel kommer att gå ut den %1$@:\n\n%2$@\n\nUtgångna nycklar kan inte användas för att kryptera eller signera nya meddelanden. Dekryptering kommer att fortsätta att fungera. Dina vänner kommer inte att kunna skicka krypterade meddelanden med denna nyckel.\n\nOm du väljer att förlänga giltigheten för din nyckel så kommer den att gälla i ytterligare två år.\n\nVill du förlänga giltigheten för din nyckel?";
KeyExpiryWarning_Yes = "Förläng nyckel";
KeyExpiryWarning_No = "Avbryt";
KeyExpiryWarning_Suppress = "Fråga inte igen";

SubkeyExpiryWarning_Title = "Varning: Din undernyckel håller på att gå ut";
SubkeyExpiryWarning_Msg = "Din undernyckel kommer att gå ut den %1$@:\n\n%2$@\n\nUtgångna undernycklar kan inte användas för att kryptera eller signera nya meddelanden. Dekryptering kommer att fortsätta att fungera. Dina vänner kommer inte att kunna skicka krypterade meddelanden med denna undernyckel.\n\nOm du väljer att förlänga giltigheten för din undernyckel så kommer den att gälla i ytterligare två år.\n\nVill du förlänga giltigheten för din undernyckel?";
SubkeyExpiryWarning_Yes = "Förläng undernyckel";
SubkeyExpiryWarning_No = "Avbryt";
SubkeyExpiryWarning_Suppress = "Fråga inte igen";

WrongPasswordTryAgain_Title = "Du angav fel lösenord";
WrongPasswordTryAgain_Msg = "Vill du försöka igen?";
WrongPasswordTryAgain_Yes = "Försök igen";
WrongPasswordTryAgain_No = "Avbryt";

KeyExpiryFailed_Title = "Misslyckades att förlänga din nyckel!";
KeyExpiryFailed_Msg = "Nyckeln\n%1$@\nkunde inte förlängas.\n\nFel: %2$@";

KeyExtendedWantToUpload_Title = "Din nyckel förlängdes";
KeyExtendedWantToUpload_Msg = "För att andra ska kunna se det nya slutdatumet måste de importera din nya nyckel. Vi rekommenderar dig därför att ladda upp din uppdaterade publika nyckel till nyckelservrarna.\n\nVarning: Nyckelservrar är publika, vilket innebär att det namn och den epostadress du använder i din nyckel kommer att vara publikt tillgängliga. Det är inte möjligt att radera nycklar från nyckelservrarna. De kan återkallas, men inte raderas.\n\nOm du föredrar att inte använda nyckelservrarna bör du fundera på att bifoga din publika nyckel till dina signerade och krypterade epostmeddelanden.\n\nVill du ladda upp din publika nyckel?";
KeyExtendedWantToUpload_Yes = "Ladda upp publik nyckel";
KeyExtendedWantToUpload_No = "Nej, tack!";

UploadFailed_Title = "Misslyckades att ladda upp nyckeln!";
UploadFailed_Msg = "Nyckeln kunde inte laddas upp till nyckelservern.\n\nFelmeddelande: %@";


UpdaterNotWorking_Title = "GPG Suite-uppdateraren fungerar inte som förväntat!";
UpdaterNotWorking_Msg = "Hämta och installera om GPG Suite från https://gpgtools.org";


SwitchToOldKeyserver_Title = "Warning: You are about to switch the key server";
SwitchToOldKeyserver_Msg = "Switching to the old key servers will lower the quality of search results. While keys.openpgp.org allows verification of the email address and only then will show the email in search results, the old key servers do not support that mechanism.\n\nWe recommend to keep using keys.openpgp.org\n\nDo you really want to switch the key server?";
SwitchToOldKeyserver_No = "Avbryt";
SwitchToOldKeyserver_Yes = "Switch to old Key Server";


